#+title: bak-readme


#+begin_src elisp
(setq org-directory vic/org-dir)


;; (after! org (setq org-pretty-entities t
;;                   org-hide-emphasis-markers t)
;;   ;; (setf (alist-get 'file org-link-frame-setup) #'vic/find-file-evil-vsplit)
;;   ;; hooks
;;   ;; (add-hook 'org-mode-hook 'turn-on-auto-fill)
;;   (add-hook 'org-mode-hook 'org-appear-mode)
;;   (add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
;;   ;; bindings
;;   (map! :map org-mode-map
;;         "C-k" #'org-previous-visible-heading
;;         "C-j" #'org-next-visible-heading))
#+end_src


over hooks is not that Terraba and I don't know why think it happen
*** Capture templates
#+begin_src elisp
(setq org-roam-capture-templates
      '(("m" "main" plain
         "%?"
         :if-new (file+head "main/${slug}.org"
                            "#+title: ${title}\n")
         :immediate-finish t
         :unnarrowed t)
        ("r" "reference" plain "%?"
         :if-new
         (file+head "reference/${title}.org" "#+title: ${title}\n#+filetags: :reference:")
         :immediate-finish t
         :unnarrowed t)
        ("d" "daft" plain "%?"
         :if-new
         (file+head "drafts/${title}.org" "#+title: ${title}\n#+filetags: :draft:\n")
         :immediate-finish t
         :unnarrowed t)))
#+end_src

#+RESULTS:
| m | main | plain | %? | :if-new | (file+head main/${slug}.org #+title: ${title} |
